{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "name": "dense_1"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["sustainability-classifier.weights.bin"],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [1, 1],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
} 